#   ha   ha  hahahah  ah   ha  hahahah
#   ha   ha  ha   ha  ha   ha  ha   ha
#   hahahah  ha   ha  hahahah  ahahaha
#   ha   ha  hahahah  ah   ah  ah   ah
#   ha   ha  ha   ha  ha   ha  ha   ha
#   ha   ha  ha   ha  ha   ha  ha   ha

#   $$$$$ $$$$$ $$$$$   @@@@@ @@@@@ @   @ @@@@@ @@@@@ @   @ @@@@@ @     @   @
#     $     $   $       @     @     @@  @   @   @   @ @   @ @     @      @ @
#     $     $   $$$$$   @     @@@@@ @ @ @   @   @   @ @   @ @@@@@ @       @
#     $     $       $   @  @@ @     @  @@   @   @   @ @   @     @ @       @
#     $     $       $   @   @ @     @   @   @   @   @ @   @     @ @       @
#   $$$$$   $   $$$$$   @@@@@ @@@@@ @   @ @@@@@ @@@@@ @@@@@ @@@@@ @@@@@   @

#   CCCCC     OOOOO      DDDD       EEEEE
#   C         O   O      D   D      E
#   C         O   O      D   D      EEEEE
#   C         O   O      D   D      E
#   C         O   O      D   D      E
#   CCCCC     OOOOO      DDDD       EEEEE

import sys

wordIn = ""
simbol = ""
masterMode = False
alphabetEng = 'a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t','u','v','w','x','y','z'
alphabetRus = 'а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я'
alphabetSpecial = ' ', '.', ',', '?', '!', '-', '+', '=', '*', '/', '<', '>'
alphabetNumbers = '0', '1', '2', '3', '4', '5', '6', '7', '8', '9','|'
alphabet = alphabetEng + alphabetRus + alphabetSpecial + alphabetNumbers
wordOut = ""
wordOutForPrint = ""
curve = ""
lenS = 0
A = " ### ", "#   #", "#   #", "#####", "#   #", "#   #"
B = "#### ", "#   #", "#### ", "#   #", "#   #", "#### "
C = "#####", "#    ", "#    ", "#    ", "#    ", "#####"
D = "#### ", "#   #", "#   #", "#   #", "#   #", "#### "
E = "#####", "#    ", "#####", "#    ", "#    ", "#####"
F = "#####", "#    ", "#####", "#    ", "#    ", "#    "
G = "#####", "#    ", "#    ", "#  ##", "#   #", "#####"
H = "#   #", "#   #", "#####", "#   #", "#   #", "#   #"
I = "#####", "  #  ", "  #  ", "  #  ", "  #  ", "#####"
J = "    #", "    #", "    #", "    #", "#   #", " ### "
K = "#   #", "# ## ", "##   ", "# #  ", "#  # ", "#   #"
L = "#    ", "#    ", "#    ", "#    ", "#    ", "#####"
M = "#   #", "## ##", "# # #", "#   #", "#   #", "#   #"
N = "#   #", "##  #", "# # #", "#  ##", "#   #", "#   #"
O = "#####", "#   #", "#   #", "#   #", "#   #", "#####"
P = "#####", "#   #", "#####", "#    ", "#    ", "#    "
Q = "#### ", "#  # ", "#  # ", "# ## ", "#  # ", "#####"
R = "###  ", "#  # ", "#  # ", "###  ", "#  # ", "#   #"
S = "#####", "#    ", "#####", "    #", "    #", "#####"
T = "#####", "  #  ", "  #  ", "  #  ", "  #  ", "  #  "
U = "#   #", "#   #", "#   #", "#   #", "#   #", "#####"
V = "#   #", "#   #", "#   #", "#   #", " # # ", "  #  "
W = "#   #", "#   #", "#   #", "# # #", "# # #", " # # "
X = "#   #", " # # ", "  #  ", " # # ", "#   #", "#   #"
Y = "#   #", " # # ", "  #  ", "  #  ", "  #  ", "  #  "
Z = "#####", "   # ", "  #  ", " #   ", "#    ", "#####"
А = " ### ", "#   #", "#   #", "#####", "#   #", "#   #"
Б = "#####", "#    ", "#### ", "#   #", "#   #", "#####"
В = "#### ", "#   #", "#### ", "#   #", "#   #", "#### "
Г = "#####", "#    ", "#    ", "#    ", "#    ", "#    "
Д = " ### ", " # # ", " # # ", " # # ", "#####", "#   #"
Е = "#####", "#    ", "#####", "#    ", "#    ", "#####"
Ё = " # # ", "#####", "#    ", "#####", "#    ", "#####"
Ж = "# # #", " # # ", "  #  ", " # # ", "# # #", "#   #"
З = "#### ", "    #", "#### ", "    #", "    #", "#### "
И = "#   #", "#  ##", "# # #", "##  #", "#   #", "#   #"
Й = " ### ", "#   #", "#  ##", "# # #", "##  #", "#   #"
К = "#   #", "# ## ", "##   ", "# #  ", "#  # ", "#   #"
Л = "  #  ", " # # ", "#   #", "#   #", "#   #", "#   #"
М = "#   #", "## ##", "# # #", "#   #", "#   #", "#   #"
Н = "#   #", "#   #", "#####", "#   #", "#   #", "#   #"
О = "#####", "#   #", "#   #", "#   #", "#   #", "#####"
П = "#####", "#   #", "#   #", "#   #", "#   #", "#   #"
Р = "#####", "#   #", "#####", "#    ", "#    ", "#    "
С = "#####", "#    ", "#    ", "#    ", "#    ", "#####"
Т = "#####", "  #  ", "  #  ", "  #  ", "  #  ", "  #  "
У = "#   #", "#   #", " # # ", "  #  ", " #   ", "#    "
Ф = "#####", "# # #", "# # #", "#####", "  #  ", "  #  "
Х = "#   #", " # # ", "  #  ", " # # ", "#   #", "#   #"
Ц = "#  # ", "#  # ", "#  # ", "#  # ", "#### ", "    #"
Ч = "#   #", "#   #", "#   #", "#####", "    #", "    #"
Ш = "# # #", "# # #", "# # #", "# # #", "# # #", "#####"
Щ = "# # #", "# # #", "# # #", "# # #", "#####", "    #"
Ъ = "##   ", " #   ", " ### ", " #  #", " #  #", " ### "
Ы = "#   #", "#   #", "##  #", "# # #", "# # #", "##  #"
Ь = "#    ", "#    ", "#### ", "#   #", "#   #", "#### "
Э = "#### ", "    #", "#####", "    #", "    #", "#### "
Ю = "# ###", "# # #", "### #", "# # #", "# # #", "# ###"
Я = "  ###", " #  #", " #  #", "  ###", " #  #", "#   #"
space = "     ", "     ", "     ", "     ", "     ", "     "
tochka = "     ", "     ", "     ", "     ", "##   ", "##   "
zapyat = "     ", "     ", "     ", "     ", " #   ", "#    "
vopros = " ### ", "#   #", "   # ", "  #  ", "     ", "  #  "
voskl = "  #  ", "  #  ", "  #  ", "  #  ", "     ", "  #  "
tire = "     ", "     ", " ### ", "     ", "     ", "     "
plus = "     ", "  #  ", " ### ", "  #  ", "     ", "     "
ravno = "     ", "     ", " ### ", " ### ", "     ", "     "
umnog = "     ", " # # ", "  #  ", " # # ", "     ", "     "
delit = "   # ", "   # ", "  #  ", "  #  ", " #   ", " #   "
strLeft = "   # ", "  #  ", " #   ", "  #  ", "   # ", "     "
strRight = " #   ", "  #  ", "   # ", "  #  ", " #   ", "     "
zero =  "#####", "#   #", "#   #", "#   #", "#   #", "#####"
one = "    #", "   ##", "  # #", "    #", "    #", "    #"
two = " ####", "#   #", "   # ", "  #  ", " #   ", "#####"
three = "#### ", "    #", "#### ", "    #", "    #", "#### "
four = "  ## ", " # # ", "#  # ", "#### ", "   # ", "   # "
five = "#####", "#    ", "#### ", "    #", "    #", "#####"
six = "#####", "#    ", "#####", "#   #", "#   #", "#####"
seven = "#####", "    #", "   # ", "   # ", "  #  ", "  #  "
eight = "#####", "#   #", "#####", "#   #", "#   #", "#####"
nine = "#####", "#   #", "#####", "    #", "    #", "#####"
i_small = "  #  ", "     ", "  #  ", "  #  ", "  #  ", "  #  "

#   @   @ @@@@@ @   @       @   @ @   @ @@@@@ @@@@@ @@@@@       @@@@@ @   @ @   @ @@@@
#   @ @@  @   @ @ @@        @@ @@ @   @ @   @ @     @   @       @     @   @ @ @@  @   @
#   @@    @   @ @@          @ @ @ @@@@@ @   @ @     @   @       @@@@   @ @  @@    @@@@
#   @ @   @@@@@ @ @         @   @ @   @ @   @ @     @   @       @   @   @   @ @   @   @
#   @  @  @   @ @  @        @   @ @   @ @   @ @     @   @       @   @  @    @  @  @   @  @@    @@    @@
#   @   @ @   @ @   @       @   @ @   @ @@@@@ @     @@@@@       @@@@@ @     @   @ @@@@   @@    @@    @@

alp = A,B,C,D,E,F,G,H,I,J,K,L,M,N,O,P,Q,R,S,T,U,V,W,X,Y,Z,А,Б,В,Г,Д,Е,Ё,Ж,З,И,Й,К,Л,М,Н,О,П,Р,С,Т,У,Ф,Х,Ц,Ч,Ш,Щ,Ъ,Ы,Ь,Э,Ю,Я,space,tochka,zapyat,vopros,voskl,tire,plus,ravno,umnog,delit, strLeft, strRight,zero, one, two, three, four, five, six, seven, eight, nine, i_small

#   $$$$$ $$$$$   $   $     $ $ $ $$$$$       $$$$$ $   $ $   $ $$$$              $$$$$ $$$$$   $   $     $ $ $ $$$$$   $     $     $
#   $     $   $  $ $  $     $ $ $ $           $     $   $ $ $$  $   $             $     $   $  $ $  $     $ $ $ $       $     $     $
#   $$$$  $   $ $   $ $$$$  $ $ $ $$$$$       $$$$   $ $  $$    $$$$              $$$$  $   $ $   $ $$$$  $ $ $ $$$$$   $     $     $
#   $   $ $   $ $   $ $   $ $ $ $ $           $   $   $   $ $   $   $             $   $ $   $ $   $ $   $ $ $ $ $       $     $     $
#   $   $ $   $ $   $ $   $ $ $ $ $           $   $  $    $  $  $   $  $          $   $ $   $ $   $ $   $ $ $ $ $
#   $$$$$ $$$$$ $   $ $$$$  $$$$$ $$$$$       $$$$$ $     $   $ $$$$  $           $$$$$ $$$$$ $   $ $$$$  $$$$$ $$$$$   $     $     $

"""def readText():
    wordIn = str(input("Введите слово: ")).lower()
    if wordIn == "":
        sys.exit()
    simbol = str(input("Каким символом вы хотите печатать текст? "))
    return wordIn, simbol

def generateText(wordIn, simbol):
    for letterWeight in range(6):
        for letterCount in range(len(wordIn)):
            wordOut = wordOut + alp[alphabet.index(wordIn[letterCount])] [letterWeight] + " "
        wordOut = wordOut.replace('#', simbol) + "\n"
        return wordOut

def generateTextForPrint(wordIn, simbol):
    for letterWeight in range(6):
        for letterCount in range(len(wordIn)):
            wordOutForPrint = wordOutForPrint + alp[alphabet.index(wordIn[letterCount])] [letterWeight] + " "
        wordOutForPrint = wordOutForPrint.replace('#', simbol) + "\\n"
        return wordOutForPrint

def main():
    while True:
        readText()
        generateText()
        print(wordOut + "\n\n\n" + wordOutForPrint)
        wordOut = ""
        wordOutForPrint = ""  """


while True:
    if masterMode == True:
        wordIn = str(input("\n@   @ @   @ @@@@@ @@@@@ @@@@@       @   @ @@@@@ @@@   @@@@              @   @ @@@@@ @   @  @@@  \n@   @ @   @ @   @   @   @           @   @ @   @ @  @  @   @             @@ @@ @   @ @@  @ @   @ \n@   @ @@@@@ @   @   @   @@@@@       @   @ @   @ @  @  @   @             @ @ @ @   @ @ @ @    @  \n@ @ @ @   @ @@@@@   @       @       @ @ @ @   @ @@@   @   @             @   @ @@@@@ @  @@   @   \n@ @ @ @   @ @   @   @       @       @ @ @ @   @ @  @  @   @  @          @   @ @   @ @   @       \n @ @  @   @ @   @   @   @@@@@        @ @  @@@@@ @   @ @@@@  @           @   @ @   @ @   @   @    \n \n>>> ")).lower()
    else:
        wordIn = str(input("Введите слово: \n>>> ")).lower()

    if wordIn == "":
        sys.exit()
    if wordIn == "<master>":
        masterMode = not(masterMode)
        continue
    if masterMode == True:
        simbol = str(input("\n@@@@@ @@@@@ @   @       @   @ @@@@@             @   @ @   @ @@@@@ @@@@@ @   @       @@@@@ @@@@@ @   @ @@@@  @@@@@ @           @@@@@       @   @ @@@@@ @@@@@ @@@@        @   @ @@@@@ @@@@@  @@@  \n@     @   @  @ @        @@ @@ @                 @   @ @   @   @   @     @   @       @       @   @@ @@ @   @ @   @ @             @         @@  @ @     @     @   @       @   @ @     @     @   @ \n@@@@@ @   @   @         @ @ @ @@@@@             @   @ @@@@@   @   @     @@@@@       @@@@@   @   @ @ @ @@@@  @   @ @             @         @ @ @ @@@@@ @@@@@ @   @       @   @ @@@@@ @@@@@    @  \n    @ @@@@@   @         @   @ @                 @ @ @ @   @   @   @     @   @           @   @   @   @ @   @ @   @ @             @         @  @@ @     @     @   @       @   @     @ @       @   \n    @ @   @   @         @   @ @      @          @ @ @ @   @   @   @     @   @           @   @   @   @ @   @ @   @ @             @         @   @ @     @     @   @       @   @     @ @           \n@@@@@ @   @   @         @   @ @@@@@ @            @ @  @   @ @@@@@ @@@@@ @   @       @@@@@ @@@@@ @   @ @@@@  @@@@@ @@@@@       @@@@@       @   @ @@@@@ @@@@@ @@@@        @@@@@ @@@@@ @@@@@   @   \n\n >>> "))
        curve = str(input("\n@@@@@ @   @ @@@   @   @ @@@@@  @@@  \n@     @   @ @  @  @   @ @     @   @ \n@     @   @ @  @  @   @ @@@@@    @  \n@     @   @ @@@   @   @ @       @   \n@     @   @ @  @   @ @  @           \n@@@@@ @@@@@ @   @   @   @@@@@   @   \n\n >>> "))
    else:
        simbol = str(input("\nКаким символом вы хотите печатать текст? \n>>> "))
    lenS = len(simbol)
    wordOut = ""
    wordOutForPrint = ""

    for letterWeight in range(6):

        if curve == "<curve>=1" and masterMode == True:
            wordOut = wordOut + " "*(6-letterWeight)
            wordOutForPrint = wordOutForPrint + " "*(6-letterWeight)
        elif curve == "<curve>=2" and masterMode == True:
            wordOut = wordOut + " "*letterWeight
            wordOutForPrint = wordOutForPrint + " "*letterWeight

        for letterCount in range(len(wordIn)):
            wordOut = wordOut + alp[alphabet.index(wordIn[letterCount])] [letterWeight] + " "
            wordOutForPrint = wordOutForPrint + alp[alphabet.index(wordIn[letterCount])] [letterWeight] + " "
            if simbol == "<simbol>" and masterMode == True:
                wordOut = wordOut.replace('#', wordIn[letterCount].upper())
                wordOutForPrint = wordOutForPrint.replace('#', wordIn[letterCount].upper())
        wordOut = wordOut.replace('#', simbol) + "\n"
        wordOutForPrint = wordOutForPrint.replace('#', simbol) + "\\n"

    print("\n" + wordOut)
    print("\n" + wordOutForPrint + "\n\n\n")

#    &&&&       &&&&&        &&&  &   & &&&&&  &&&        &   & &&&&&       &&&&  &&&&& &&&&& &&&&&       &&&&&   &   &&&&& &&&&& &&&&& &   & &&&&& &   &
#   &   &       &            & &  &   & &     &   &       &   & &   &           &   &   &   &   &         &   &  & &  &     &   & &   & &  &&   &   && &&
#      &        &&&&         & &  &&&&& &&&&& &  &&       &&&&& &   &       &&&&&   &   &   &   &         &   & &   & &     &   & &&&&& & & &   &   & & &
#     &             &        & &  &   & &     & & &       &   & &&&&&           &   &   &   &   &         &&&&& &   & &     &   & &     &&  &   &   &   &
#    &    &&        &       &&&&& &   & &     &&  &       &   & &   &           &   &   &   &   &         &   & &   & &     &   & &     &   &   &   &   & &&    &&    &&
#   &&&&& &&    &&&&&       &   & &   & &&&&& &   &       &   & &   &       &&&&    &   &&&&&   &         &   & &   & &     &&&&& &     &   &   &   &   & &&    &&    &&
